In [4]:
from pandas import Series, DataFrame

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [ ]:
#5.3기술통계 계산과 요약: pandas에서는 객체의 값들에 대해 기술통계, 요약통계를 구할 수 있다.

In [7]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])

In [8]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [9]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [10]:
df.sum(axis = 0) #axis = 연산을 수행할 축, 0은 행, 1은 열이다.

one    9.25
two   -5.80
dtype: float64

In [11]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [9]:
df.mean(axis = 1, skipna = False) #skipna = 누락된 값을 제외할 것인지 정하는 옵션, 기본 값은 True이다.

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
df.idxmax() #idmax = 각 열에서 최대값을 가지고 있는 색인의 값을 반환한다.

one    b
two    d
dtype: object

In [13]:
df.cumsum() #cumsum = 누적 합을 구한다.

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [14]:
df.describe() #describe = Series나 DataFrame의 각 칼럼에 대한 요약통계를 계산한다.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [15]:
obj = Series(['a','a','b','c']*4)

In [19]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [ ]:
#5.3-1 상관관계와 공분산

In [189]:
!!pip install pandas-datareader

['Collecting pandas-datareader',
 '  Downloading https://files.pythonhosted.org/packages/be/76/639c60ede26458dadf76bacaa9cbcc76f8cc5082fb2b2d90d0a90c699d36/pandas_datareader-0.6.0-py2.py3-none-any.whl (103kB)',
 'Requirement already satisfied: wrapt in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas-datareader) (1.10.11)',
 'Collecting requests-ftp (from pandas-datareader)',
 '  Downloading https://files.pythonhosted.org/packages/3d/ca/14b2ad1e93b5195eeaf56b86b7ecfd5ea2d5754a68d17aeb1e5b9f95b3cf/requests-ftp-0.3.1.tar.gz',
 'Requirement already satisfied: requests>=2.3.0 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas-datareader) (2.18.4)',
 'Requirement already satisfied: pandas>=0.19.2 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas-datareader) (0.20.3)',
 'Collecting requests-file (from pandas-datareader)',
 '  Downloading https://files.pythonhosted.org/packages/23/9c/6e63c23c39e53d3df41c77a3d05a49a42c4e1383a6d2a5e3233161b89dbf/requests_file-1.4.3-py2.py3-none-any.whl',
 'Requirement already satisfied: lxml in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas-datareader) (4.1.0)',
 'Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from requests>=2.3.0->pandas-datareader) (3.0.4)',
 'Requirement already satisfied: idna<2.7,>=2.5 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from requests>=2.3.0->pandas-datareader) (2.6)',
 'Requirement already satisfied: urllib3<1.23,>=1.21.1 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from requests>=2.3.0->pandas-datareader) (1.22)',
 'Requirement already satisfied: certifi>=2017.4.17 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from requests>=2.3.0->pandas-datareader) (2017.7.27.1)',
 'Requirement already satisfied: python-dateutil>=2 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas>=0.19.2->pandas-datareader) (2.6.1)',
 'Requirement already satisfied: pytz>=2011k in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas>=0.19.2->pandas-datareader) (2017.2)',
 'Requirement already satisfied: numpy>=1.7.0 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from pandas>=0.19.2->pandas-datareader) (1.14.3)',
 'Requirement already satisfied: six in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from requests-file->pandas-datareader) (1.11.0)',
 'Building wheels for collected packages: requests-ftp',
 '  Running setup.py bdist_wheel for requests-ftp: started',
 "  Running setup.py bdist_wheel for requests-ftp: finished with status 'done'",
 '  Stored in directory: /home/nbuser/.cache/pip/wheels/2a/98/32/37195e45a3392a73d9f65c488cbea30fe5bad76aaef4d6b020',
 'Successfully built requests-ftp',
 "grpcio 1.11.0 has requirement protobuf>=3.5.0.post1, but you'll have protobuf 3.4.1 which is incompatible.",
 'Installing collected packages: requests-ftp, requests-file, pandas-datareader',
 'Successfully installed pandas-datareader-0.6.0 requests-file-1.4.3 requests-ftp-0.3.1']

In [190]:
import pandas as pd

In [191]:
from pandas_datareader import data

In [206]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker, 'google', '2015-01-01', '2016-01-01')  
price = pd.DataFrame({tic: data['Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()}) #왜 오류가 날까요?....ㅠㅠㅠ

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/pandas_datareader/google/daily.py:40: UnstableAPIWarning:
The Google Finance API has not been stable since late 2017. Requests seem
to fail at random. Failure is especially common when bulk downloading.

  warnings.warn(UNSTABLE_WARNING, UnstableAPIWarning)

RemoteDataError: Unable to read URL: https://finance.google.com/finance/historical?q=AAPL&startdate=Jan+01%2C+2015&enddate=Jan+01%2C+2016&output=csv
Response Text:
b'<html><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><title>Sorry...</title><style> body { font-family: verdana, arial, sans-serif; background-color: #fff; color: #000; }</style></head><body><div><table><tr><td><b><font face=sans-serif size=10><font color=#4285f4>G</font><font color=#ea4335>o</font><font color=#fbbc05>o</font><font color=#4285f4>g</font><font color=#34a853>l</font><font color=#ea4335>e</font></font></b></td><td style="text-align: left; vertical-align: bottom; padding-bottom: 15px; width: 50%"><div style="border-bottom: 1px solid #dfdfdf;">Sorry...</div></td></tr></table></div><div style="margin-left: 4em;"><h1>We\'re sorry...</h1><p>... but your computer or network may be sending automated queries. To protect our users, we can\'t process your request right now.</p></div><div style="margin-left: 4em;">See <a href="https://support.google.com/websearch/answer/86640">Google Help</a> for more information.<br/><br/></div><div style="text-align: center; border-top: 1px solid #dfdfdf;"><a href="https://www.google.com">Google Home</a></div></body></html>'

In [ ]:
#5.3-2 유일 값, 값 세기, 멤버십

In [43]:
##Series에서의 유일 값, 값 세기, 멤버십

In [36]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [37]:
unique = obj.unique() #unique = 유일 값만 담은 Series 만듦

In [38]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [39]:
obj.value_counts() #value_counts = 유일 값에 대한 색인 값과 도수 계산, 이때 결과는 도수의 내림차순으로 정렬된다.
#(a가 몇개인지, b가 몇개인지...)

c    3
a    3
b    2
d    1
dtype: int64

In [44]:
pd.value_counts(obj.values, sort = False) #어떤 순서로 정렬되는거지?...

a    3
b    2
d    1
c    3
dtype: int64

In [45]:
mask = obj.isin(['b','c']) #isin = 어떤 값이 Series에 있는지 true, false로 나타내준다.

In [46]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [47]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [ ]:
##DataFrame에서의 유일 값, 값 세기, 멤버십

In [48]:
data = DataFrame({'QU1':[1,3,4,3,4],
                 'QU2':[2,3,1,2,3],
                 'QU3':[1,5,2,4,4]})

In [49]:
data

   QU1  QU2  QU3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [50]:
result = data.apply(pd.value_counts).fillna(0) #열에서 각 변수의 갯수(1이 몇개인지, 2가 몇개인지 등등)을 정렬하여 보여줌, 이때 결측치는 0, 
#fillna = 누락된 데이터를 대신할 값을 채우는데 사용

In [51]:
result

   QU1  QU2  QU3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [ ]:
#5.4 누락된 데이터 처리하기

In [ ]:
###pandas는 누락된 데이터를 실수든 아니든 간에 모두 NAN으로 취급하기 때문에, 누락된 값을 쉽게 찾을 수 있다.

In [52]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [53]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [54]:
string_data.isnull() #누락된 값인지 그렇지 않은지를 true, false 값으로 알려줌

0    False
1    False
2     True
3    False
dtype: bool

In [55]:
string_data[0] = None

In [57]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [ ]:
#5.4-1 누락된 데이터 골라내기

In [ ]:
##series에서 누락된 데이터를 골라낼 때

In [58]:
from numpy import nan as NA

In [59]:
DATA = Series([1, NA, 3.5, NA, 7])

In [60]:
DATA.dropna() #dropna = 누락된 데이터가 있는 축(행, 혹은 열)을 제외시킨다.

0    1.0
2    3.5
4    7.0
dtype: float64

In [62]:
DATA.notnull() #isnull의 반대

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [63]:
DATA[DATA.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
##DataFrame에서 누락된 데이터를 골라낼 때

In [64]:
data = DataFrame([[1.,6.5, 3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [65]:
cleaned = data.dropna()

In [67]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [68]:
cleaned #NA값이 하나라도 있는 행은 제외시킨다.

     0    1    2
0  1.0  6.5  3.0

In [69]:
data.dropna(how = 'all') #모든 값이 NA인 행만 제외시킨다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [70]:
data[4] = NA

In [71]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [72]:
data.dropna(axis = 1, how = 'all') #열을 제외시키는 방법

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [73]:
df = DataFrame(np.random.randn(7,3))

In [75]:
df.ix[:4,1] = NA; df.ix[:2,2] = NA

In [77]:
df

          0         1         2
0 -0.987787       NaN       NaN
1  1.153548       NaN       NaN
2  1.478943       NaN       NaN
3 -0.028418       NaN -1.947571
4  0.474995       NaN -1.786323
5 -0.635687 -0.752713 -0.309371
6  0.233133 -0.010323 -1.378447

In [80]:
df.dropna(thresh = 3) #결측치가 아닌 값이 몇개인지.

          0         1         2
5 -0.635687 -0.752713 -0.309371
6  0.233133 -0.010323 -1.378447

In [ ]:
#5.4-2 누락된 값 채우기

In [81]:
df.fillna(0) #결측치를 0으로 채운다.

          0         1         2
0 -0.987787  0.000000  0.000000
1  1.153548  0.000000  0.000000
2  1.478943  0.000000  0.000000
3 -0.028418  0.000000 -1.947571
4  0.474995  0.000000 -1.786323
5 -0.635687 -0.752713 -0.309371
6  0.233133 -0.010323 -1.378447

In [84]:
df.fillna({1:0.5,3:-1}) #각 열마다 어떤 값으로 결측치를 채울 것인지.

          0         1         2
0 -0.987787  0.500000       NaN
1  1.153548  0.500000       NaN
2  1.478943  0.500000       NaN
3 -0.028418  0.500000 -1.947571
4  0.474995  0.500000 -1.786323
5 -0.635687 -0.752713 -0.309371
6  0.233133 -0.010323 -1.378447

In [85]:
_ = df.fillna(0,inplace = True) #inplace = 복사본을 생성하지 않고 호출한 객체를 변경한다.

In [86]:
df

          0         1         2
0 -0.987787  0.000000  0.000000
1  1.153548  0.000000  0.000000
2  1.478943  0.000000  0.000000
3 -0.028418  0.000000 -1.947571
4  0.474995  0.000000 -1.786323
5 -0.635687 -0.752713 -0.309371
6  0.233133 -0.010323 -1.378447

In [87]:
df = DataFrame(np.random.randn(6, 3))

In [89]:
df.ix[2:,1] = NA; df.ix[4:,2] = NA

In [90]:
df

          0         1         2
0 -0.137897  1.423598 -0.024334
1  0.104688  0.575346  1.088621
2  0.146972       NaN -1.852320
3 -0.171309       NaN -1.090133
4 -0.316692       NaN       NaN
5  1.426610       NaN       NaN

In [91]:
df.fillna(method = 'ffill') #method = 값을 어떤 방식으로 채울 것인지.

          0         1         2
0 -0.137897  1.423598 -0.024334
1  0.104688  0.575346  1.088621
2  0.146972  0.575346 -1.852320
3 -0.171309  0.575346 -1.090133
4 -0.316692  0.575346 -1.090133
5  1.426610  0.575346 -1.090133

In [ ]:
df.fillna(method = 'fillna',limit = 2) #limit = 값을 앞에서부터 몇개씩 채울 것인지.

In [92]:
data = Series([1., NA, 3.5, NA, 7])

In [94]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [93]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [ ]:
#5.5 계층적 색인

In [ ]:
##Series에서의 계층적 색인

In [95]:
data = Series(np.random.randn(10), index = [['a','a','a','b','b','b','c','c','d','d'], [1,2,3,1,2,3,1,2,2,3]])

In [96]:
data

a  1   -0.058238
   2    1.126478
   3   -1.377060
b  1    0.424647
   2   -0.262671
   3   -0.432625
c  1    0.585473
   2    0.471674
d  2   -0.203016
   3   -1.217946
dtype: float64

In [97]:
data.index #색인이 어떤 계층으로 이루어져 있는지

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [98]:
data['b']

1    0.424647
2   -0.262671
3   -0.432625
dtype: float64

In [101]:
data['b':'c']

b  1    0.424647
   2   -0.262671
   3   -0.432625
c  1    0.585473
   2    0.471674
dtype: float64

In [102]:
data.ix[['b','d']]

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

b  1    0.424647
   2   -0.262671
   3   -0.432625
d  2   -0.203016
   3   -1.217946
dtype: float64

In [106]:
data[:,3] #하위 계층의 객체를 선택하는 것도 가능

-1.377060309881429

In [107]:
data.unstack() #테이블 형식으로 정렬할 수 있다.

          1         2         3
a -0.058238  1.126478 -1.377060
b  0.424647 -0.262671 -0.432625
c  0.585473  0.471674       NaN
d       NaN -0.203016 -1.217946

In [108]:
data.unstack().stack() #테이블 형태에서 다시 풀어주는 것도 가능하다.

a  1   -0.058238
   2    1.126478
   3   -1.377060
b  1    0.424647
   2   -0.262671
   3   -0.432625
c  1    0.585473
   2    0.471674
d  2   -0.203016
   3   -1.217946
dtype: float64

In [ ]:
##DataFrame에서의 계층적 색인

In [110]:
frame = DataFrame(np.arange(12).reshape((4,3)),index = [['a', 'a', 'b', 'b'], [1,2,1,2]], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [111]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [ ]:
#계층적 색인의 각 단계는 이름을 가질 수 있으며, 이름이 있을 경우 콘솔 출력시 함께 나타남

In [112]:
frame.index.names = ['key1', 'key2'] #색인의 이름 지정

In [114]:
frame.columns.names = ['state', 'color'] #칼럼의 이름 지정

In [115]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [116]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [118]:
frame.index #DataFrame에서

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [ ]:
#5.5-1 계층 순서 바꾸고 정렬하기

In [119]:
frame.swaplevel('key1','key2') #swaplevel = 2개의 계층 번호나 이름이 뒤바뀐 새로운 객체 반환한다.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [124]:
frame.sortlevel(1) #단일 계층에 속한 데이터를 정렬한다.

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [125]:
frame.swaplevel(0,1).sortlevel(0) #swaplevel을 하여 계층을 바꾼 이후 사전식으로 정렬할 수 있음

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  if __name__ == '__main__':

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [ ]:
#5.5-2 단계별 요약통계

In [128]:
frame.sum(level = 'key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [130]:
frame.sum(level = 'state', axis = 1)

state      Colorado  Ohio
key1 key2
a    1            2     1
     2            5     7
b    1            8    13
     2           11    19

In [132]:
#5.5-3 DataFrame의 칼럼 사용하기

In [133]:
frame = DataFrame({'a':range(7), 'b': range(7,0,-1),'c': ['one','one','one','two','two','two','two'],'d': [0,1,2,0,1,2,3]})

In [134]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [135]:
frame2 = frame.set_index(['c', 'd']) #set_index = 칼럼을 색인으로 하는 새로운 DataFrame을 만들 수 있음

In [136]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [137]:
frame.set_index(['c', 'd'], drop = False) #칼럼을 명시적으로 남겨두지 않으면 DataFrame에서 삭제된다.

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [140]:
frame2.reset_index()  #reset_index = 방금 전 설정했던 계층적 색인 단계가 칼럼으로 이동한다.

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [ ]:
#5.6 기타 주제

In [ ]:
#5.6-1

In [141]:
ser = Series(np.arange(3.))

In [144]:
ser[-1] #오류 발생

KeyError: -1

In [146]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [147]:
ser2 = Series(np.arange(3.), index = ['a','b','c'])

In [148]:
ser2[-1]

2.0

In [149]:
ser.ix[:1]

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

0    0.0
1    1.0
dtype: float64

In [150]:
ser3 = Series(range(3), index = [-5, 1, 3])

In [152]:
ser3.iloc[2]

2

In [155]:
frame = DataFrame(np.arange(6).reshape(3,2),index = [2,0,1])

In [156]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [165]:
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64